app/Services/DiarioCajaService.php

    public function __construct()
    {
        // Obtén el registro de DiarioCaja para el día actual
        $this->diarioCaja = DiarioCaja::whereDate('created_at', Carbon::today())->whereNotNull('caja_apertura')->whereNull('caja_cierre')->first();
        $this->diarioCajaHoy = DiarioCaja::whereDate('created_at', Carbon::today())->first();
---
select * from `diario_cajas` where date(`created_at`) = '2026-01-25' and `caja_apertura` is not null and `caja_cierre` is null limit 1
select * from `diario_cajas` where date(`created_at`) = '2026-01-25' limit 1