app/Services/ReciboService.php

select * from `recibos` where `deleted_at` is null and date(`created_at`) = '2026-01-25' and `recibos`.`deleted_at` is null order by `id` desc
---
    public function searchByFechaHoy(){
        $fechaHoy = Carbon::today();
        $inicioDia = $fechaHoy->copy()->startOfDay();
        $finDia = $fechaHoy->copy()->endOfDay();

        $recibos = Recibo::whereNull('deleted_at')
            ->whereBetween('created_at', [$inicioDia, $finDia])
            ->orderBy('id', 'desc')
            ->get();

select sum(CASE WHEN es_cobro = 1 THEN monto ELSE -monto END) as aggregate from `recibos` where `deleted_at` is null and date(`created_at`) = '2026-01-25' and `afectar_caja` = 1 and `recibos`.`deleted_at` is null
---
    public function getTotalesByFechaHoy() {
        $fechaHoy = Carbon::today();
        $inicioDia = $fechaHoy->copy()->startOfDay();
        $finDia = $fechaHoy->copy()->endOfDay();

        $total = Recibo::whereNull('deleted_at')
            ->whereBetween('created_at', [$inicioDia, $finDia])
            ->where('afectar_caja',1)
            ->sum(\DB::raw('CASE WHEN es_cobro = 1 THEN monto ELSE -monto END'));

select sum(CASE WHEN es_cobro = 1 THEN rm.valor ELSE -rm.valor END) as aggregate from `recibos` as `r` inner join `recibos_metodos_pagos` as `rm` on `r`.`id` = `rm`.`id_recibo` inner join `metodos_pagos` as `mp` on `mp`.`id` = `rm`.`id_metodo_pago` where date(`r`.`created_at`) = '2026-01-25' and `r`.`deleted_at` is null and `r`.`afectar_caja` = 1 and (`mp`.`nombre` = 'Efectivo' or `mp`.`nombre` = 'Cheque')
---
    public function getTotalesEfectivoByFechaHoy() {

        $fechaHoy = Carbon::today();
        $inicioDia = $fechaHoy->copy()->startOfDay();
        $finDia = $fechaHoy->copy()->endOfDay();
        $totalEfectivo = Recibo::withTrashed()->from('recibos as r')
        ->join('recibos_metodos_pagos as rm', 'r.id', '=', 'rm.id_recibo')
        ->join('metodos_pagos as mp', 'mp.id', '=', 'rm.id_metodo_pago')
        ->whereBetween('r.created_at', [$inicioDia, $finDia])
        ->whereNull('r.deleted_at')
        ->where('r.afectar_caja',1)
        ->where(function($query) {
            $query->where('mp.nombre', 'Efectivo')
                ->orWhere('mp.nombre', 'Cheque');
        })
        ->sum(\DB::raw('CASE WHEN es_cobro = 1 THEN rm.valor ELSE -rm.valor END'));