app/Producto.php

    protected static function boot(): void
    {
        parent::boot();

        static::retrieved(function ($model) {
            $model->param = Cache::remember('dolar', now()->addSeconds(10), function () {
                // Consulta la base de datos para obtener el valor del dólar y devuelve el resultado.
                return Parametro::select('dolar')->first();
---
select `dolar` from `parametros` limit 1