app/Livewire/Venta/GestionVenta.php

    public function mount()
    {
        $this->tipos = TipoVenta::all();
        $this->clientes = Cliente::all();
        $this->vendedores = Vendedor::where('estado', true)->get();
        $this->marcas = Marca::all();
        $this->rubros = Rubro::all();
        $this->proveedores = Proveedor::all();
        $this->productos = collect();
        $this->listasDescuento = Lista::all();
---
select * from `clientes` where `clientes`.`deleted_at` is null
select * from `vendedores` where `estado` = 1
select * from `marcas`
select * from `rubros`
select * from `proveedores`
select * from `listas_descuento` where `listas_descuento`.`deleted_at` is null

    public function updatedCliente($value)
    {
        $clienteObj = Cliente::find($value);
---
select * from `clientes` where `clientes`.`id` = '1' and `clientes`.`deleted_at` is null limit 1

    public function seleccionarProducto($id)
    {
        $this->productoSeleccionado = Producto::find($id);
---
select * from `productos` where `productos`.`id` = 1 and `productos`.`deleted_at` is null limit 1