app/Http/Controllers/ClienteController.php

select * from `clientes` where `deleted_at` is null and `clientes`.`deleted_at` is null
---
    public function index()
    {
        $clientes = Cliente::whereNull('deleted_at')->get();