app/Http/Controllers/DashboardController.php

    public function index()
    {
        $parametro = Parametro::get();
        $tiposRecibos = TipoRecibo::all();
        $clientes = Cliente::whereNull('deleted_at')->orderBy('razon_social','ASC')->get();
        $proveedores = Proveedor::whereNull('deleted_at')->orderBy('nombre','ASC')->get();
        $metodosPago = MetodoPago::all();
        $cheques = Cheque::whereNull('deleted_at')->orderBy('fecha_emision','ASC')->orderBy('estado','DESC')->get();
        $chequesDisponibles = Cheque::whereNull('deleted_at')->where('estado',1)->orderBy('fecha_emision','ASC')->get();
        $totalChequesDisponibles = Cheque::where([['deleted_at',null],['estado',1]])->count();
        $totalClientesDeudores = Cliente::where('deleted_at',null)->where('estado_cuenta',0)->count();
        $totalProductosStockMinimo = Producto::where('deleted_at',null)->whereColumn('stock','<=','stock_minimo')->count();
        $startDate = Carbon::now()->subDays(7);
        $endDate = Carbon::now();
        $cajaDiaria = DiarioCaja::whereDate('created_at', Carbon::today())->first();
        $estadoCaja = $this->diarioCajaService->getEstadoCaja();
        $totalVentasUltimosSieteDias = DB::table('ventas')
            ->whereBetween('created_at', [$startDate, $endDate])
            ->count();
---
select * from `parametros`
select * from `clientes` where `deleted_at` is null and `clientes`.`deleted_at` is null order by `razon_social` asc
select * from `cheques` where `deleted_at` is null order by `fecha_emision` asc, `estado` desc
select * from `cheques` where `deleted_at` is null and `estado` = 1 order by `fecha_emision` asc
select count(*) as aggregate from `cheques` where (`deleted_at` is null and `estado` = 1)
select count(*) as aggregate from `clientes` where `deleted_at` is null and `estado_cuenta` = 0 and `clientes`.`deleted_at` is null
select count(*) as aggregate from `productos` where `deleted_at` is null and `stock` <= `stock_minimo` and `productos`.`deleted_at` is null
select * from `diario_cajas` where date(`created_at`) = '2026-01-25' limit 1
select count(*) as aggregate from `ventas` where `created_at` between '2026-01-18 23:03:14' and '2026-01-25 23:03:14'